In [10]:
import pandas as pd
import matplotlib.pyplot as plt
import ast
from datasets import load_dataset
from datetime import datetime

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [6]:
df_date = df.copy()
df_date['job_posted_date_str'] = df_date['job_posted_date'].apply(lambda x: x.strftime('%Y-%m-%d'))
df_date[['job_posted_date','job_posted_date_str']]

           job_posted_date job_posted_date_str
0      2023-06-16 13:44:15          2023-06-16
1      2023-01-14 13:18:07          2023-01-14
2      2023-10-10 13:14:55          2023-10-10
3      2023-07-04 13:01:41          2023-07-04
4      2023-08-07 14:29:36          2023-08-07
...                    ...                 ...
785736 2023-03-13 06:16:16          2023-03-13
785737 2023-03-12 06:18:18          2023-03-12
785738 2023-03-12 06:32:36          2023-03-12
785739 2023-03-12 06:32:15          2023-03-12
785740 2023-03-13 06:16:31          2023-03-13

[785741 rows x 2 columns]

In [21]:
(2024-6-16 - 2023-6-16)

-43

In [27]:
datetest = pd.to_datetime(2023-6-16)
(current_date - datetest)

Timedelta('20070 days 15:06:58.918330999')

In [19]:
df_days = df.copy()
current_date = datetime.now()

df_days['day_since_posted'] = df_days['job_posted_date'].apply(lambda date: (current_date - date).days)
df_days[['job_posted_date', 'day_since_posted']].head()

#.days filters and prints out the attribute of the days difference

      job_posted_date  day_since_posted
0 2023-06-16 13:44:15               546
1 2023-01-14 13:18:07               699
2 2023-10-10 13:14:55               430
3 2023-07-04 13:01:41               528
4 2023-08-07 14:29:36               494

In [31]:
df_sl = df.copy()
df_sl.dropna(subset='salary_year_avg', inplace=True)
df_sl['salary_category'] = df_sl['salary_year_avg'].apply(lambda x: 'Low' if x <60000 else 'Medium' if 60000 < x < 100000 else 'High')
df_sl[['salary_year_avg', 'salary_category']]

        salary_year_avg salary_category
28             109500.0            High
77             140000.0            High
92             120000.0            High
100            228222.0            High
109             89000.0          Medium
...                 ...             ...
785624         139216.0            High
785641         150000.0            High
785648         221875.0            High
785682         157500.0            High
785692         157500.0            High

[22003 rows x 2 columns]